
using System.Collections.Generic;

namespace DesARMA
{
    public class Reest
    {
        public static List<string> sNazyv = new List<string>()
        {
"Державний реєстр речових прав на нерухоме майно, Реєстр речових прав на нерухоме майно, Державний реєстр іпотек, Єдиний реєстр заборон відчуження об’єктів нерухомого майна",
"Державний земельний кадастр",
"Єдиний державний реєстр транспортних засобів",
"Єдиний реєстр довіреностей",
"Державний реєстр актів цивільного стану громадян",
"Єдиного державного реєстру юридичних осіб, фізичних осіб-підприємців та громадських формувань",
"ІКС «Податковий блок»",
"Державний реєстр обтяжень рухомого майна",
"ІКС «Єдине вікно подання електронної звітності»",
"Інтегрована міжвідомча інформаційно-телекомунікаційна система контролю осіб, транспортних засобів та вантажів, які перетинають державний кордон (система «Аркан»)",
"Спадковий реєстр",
"Державний реєстр фізичних осіб – платників податків",
"Державна казначейська служба України про проведені платіжні транзакції на єдиному казначейському рахунку щодо використання коштів державного та місцевих бюджетів",
"дані Національної комісії, що здійснює державне регулювання у сферах енергетики та комунальних послуг",
"Єдиний реєстр боржників",
"Державний реєстр цивільних повітряних суден",
"Єдина державна система електронного обліку деревини",
"інтегрована інформаційно-пошукова система органів внутрішніх справ України",
"інформаційно-аналітична система «Облік відомостей про притягнення особи до кримінальної відповідальності та наявності судимості»",
"Єдиний державний реєстр тварин",
"Єдиний державний реєстр ветеринарних документів",
"Суднова книга України",
"Державний судновий реєстр України",
" Реєстр заяв про повернення суми бюджетного відшкодування податку на додану вартість",
"бази даних та інформаційно-довідкові системи ДП «Український інститут інтелектуальної власності»",
"Державної служби України з питань праці",
"автоматизовані реєстри та бази даних, держателем (адміністратором) яких є Національна комісія з цінних паперів та фондового ринку",
"Реєстр складських документів на зерно та зерна, прийнятого на зберігання",
"дані Антимонопольного комітету України",
"за допомогою інструментів OSINT"
        };
        public static List<string> sRodov = new List<string>()
        {
"Державного реєстру речових прав на нерухоме майно, Реєстру речових прав на нерухоме майно, Державного реєстру іпотек, Єдиного реєстру заборон відчуження об’єктів нерухомого майна",
"Державного земельного кадастру",
"Єдиного державного реєстру транспортних засобів",
"Єдиного реєстру довіреностей",
"Державного реєстру актів цивільного стану громадян",
"Єдиного державного реєстру юридичних осіб, фізичних осіб-підприємців та громадських формувань",
"ІКС «Податковий блок»",
"Державного реєстру обтяжень рухомого майна",
"ІКС «Єдине вікно подання електронної звітності»",
"Інтегрованої міжвідомчої інформаційно-телекомунікаційної системи контролю осіб, транспортних засобів та вантажів, які перетинають державний кордон (система «Аркан»)",
"Спадкового реєстру",
"Державного реєстру фізичних осіб – платників податків",
"Державної казначейської служби України про проведені платіжні транзакції на єдиному казначейському рахунку щодо використання коштів державного та місцевих бюджетів",
"даних Національної комісії, що здійснює державне регулювання у сферах енергетики та комунальних послуг",
"Єдиного реєстру боржників",
"Державного реєстру цивільних повітряних суден",
"Єдиної державної системи електронного обліку деревини",
"інтегрованої інформаційно-пошукової системи органів внутрішніх справ України",
"інформаційно-аналітичної системи «Облік відомостей про притягнення особи до кримінальної відповідальності та наявності судимості»",
"Єдиного державного реєстру тварин",
"Єдиного державного реєстру ветеринарних документів",
"Суднової книги України",
"Державного суднового реєстру України",
" Реєстр заяв про повернення суми бюджетного відшкодування податку на додану вартість",
"баз даних та інформаційно-довідкових систем ДП «Український інститут інтелектуальної власності»",
"Державної служби України з питань праці",
"автоматизованих реєстрів та баз даних, держателем (адміністратором) яких є Національна комісія з цінних паперів та фондового ринку",
"Реєстру складських документів на зерно та зерна, прийнятого на зберігання",
"даних Антимонопольного комітету України",
"за допомогою інструментів OSINT"
            };
        public static List<string> sDav = new List<string>()
        {
"Державному реєстрі речових прав на нерухоме майно, Реєстрі речових прав на нерухоме майно, Державному реєстрі іпотек, Єдиному реєстрі заборон відчуження об’єктів нерухомого майна",
"Державному земельному кадастрі",
"Єдиному державному реєстрі транспортних засобів",
"Єдиному реєстрі довіреностей",
"Державному реєстрі актів цивільного стану громадян",
"Єдиному державному реєстрі юридичних осіб, фізичних осіб-підприємців та громадських формувань",
"ІКС «Податковий блок»",
"Державному реєстрі обтяжень рухомого майна",
"ІКС «Єдине вікно подання електронної звітності»",
"Інтегрованій міжвідомчій інформаційно-телекомунікаційній системі контролю осіб, транспортних засобів та вантажів, які перетинають державний кордон (система «Аркан»)",
"Спадковому реєстрі",
"Державному реєстрі фізичних осіб – платників податків",
"Державній казначейській службі України про проведені платіжні транзакції на єдиному казначейському рахунку щодо використання коштів державного та місцевих бюджетів",
"даних Національної комісії, що здійснює державне регулювання у сферах енергетики та комунальних послуг",
"Єдиному реєстрі боржників",
"Державному реєстрі цивільних повітряних суден",
"Єдиній державній системі електронного обліку деревини",
"інтегрованій інформаційно-пошуковій системі органів внутрішніх справ України",
"інформаційно-аналітичній системі «Облік відомостей про притягнення особи до кримінальної відповідальності та наявності судимості»",
"Єдиному державному реєстрі тварин",
"Єдиному державному реєстрі ветеринарних документів",
"Судновій книзі України",
"Державному судновому реєстрі України",
" Реєстрі заяв про повернення суми бюджетного відшкодування податку на додану вартість",
"базах даних та інформаційно-довідкових системам ДП «Український інститут інтелектуальної власності»",
"Державній службі України з питань праці",
"автоматизованих реєстрах та базах даних, держателем (адміністратором) яких є Національна комісія з цінних паперів та фондового ринку",
"Реєстрі складських документів на зерно та зерна, прийнятого на зберігання",
"даних Антимонопольного комітету України",
"за допомогою інструментів OSINT"

            };
        public static List<int> sGrupa = new List<int>();
        public static List<string> sub = new List<string>
        {
            "зазначених", "зазначеної", "зазначеним", "зазначеній"
        };
        public static List<string> sub2 = new List<string>
        {
            "осіб", "особи", "особам", "особі",
        };
        public static List<string> organs = new List<string>()
        {
            //дбр
            "Відповідно до пункту 1 розділу VI Порядку взаємодії АРМА і Державного бюро розслідувань щодо виявлення та розшуку активів від 26.04.2021 № 151/262, зареєстрованим в Міністерстві юстиції України від 14.05.2021 за № 642/36264, АРМА здійснює заходи з виявлення, розшуку активів, виходячи зі змісту звернення, в межах визначених Законом повноважень та з урахуванням ступеня фактичного доступу до джерел даних, що знаходяться у розпорядженні третіх осіб.",
            //беб
            "Відповідно до пункту 1 розділу VI Порядку взаємодії при розгляді звернень Бюро економічної безпеки України, та виконанні запитів іноземних держав щодо виявлення та розшуку активів, затвердженого спільним наказом АРМА, БЕБ від 22.02.2022 №54/50, зареєстрованим в Міністерстві юстиції України 11.05.2022 за №507/37843, АРМА здійснює заходи з виявлення, розшуку активів, виходячи зі змісту звернення, в межах визначених Законом повноважень та з урахуванням ступеня фактичного доступу до джерел даних, що знаходяться у розпорядженні третіх осіб.",
            //мінюст
            "Згідно з пунктом 8 розділу ІІ Порядку надання АРМА інформації на запити Міністерства юстиції України при реалізації державної політики у сфері стягнення в дохід держави активів осіб, щодо яких застосовано санкції, затвердженого наказом Міністерства юстиції України, АРМА від 29.06.2022 № 2703/5/140, зареєстрованого в Міністерстві юстиції України 29.06.2022  за № 710/38046 (далі – Порядок), АРМА здійснює заходи з виявлення, розшуку активів, виходячи зі змісту запиту, у межах повноважень, визначених Законом України «Про Національне агентство України з питань виявлення, розшуку та управління активами, одержаними від корупційних та інших злочинів», та з урахуванням ступеня фактичного доступу до джерел даних, що перебувають у розпорядженні третіх осіб.",
            //інші 
            "Відповідно до пункту 1 розділу VI Порядку взаємодії при розгляді звернень органів, що здійснюють досудове розслідування, прокуратури та виконанні запитів іноземних держав щодо виявлення та розшуку активів, затвердженого спільним наказом АРМА, Національного антикорупційного бюро України, Генеральної прокуратури України, Служби безпеки України, Міністерства внутрішніх справ України, Міністерства фінансів України від 20.10.2017 № 115/197-о/297/586/869/857, зареєстрованого в Міністерстві юстиції України 02.11.2017 за № 1342/31210 (далі – Порядок), АРМА здійснює заходи з виявлення, розшуку активів, виходячи зі змісту звернення, в межах визначених Законом повноважень та з урахуванням ступеня фактичного доступу до джерел даних, що знаходяться у розпорядженні третіх осіб."
        };
        public static List<string> organsName = new List<string> {"ДБР","БЕБ","МІНЮСТ", "Інші" };
        public static List<string> abbreviatedName = new List<string>();
        public static List<string> namesField = new List<string>()
        {
            "Найменування юридичної особи",
            "Cкорочене найменування юридичної особи",
            "Ідентифікаційний код юридичної особи",
            "Актуальний стан на фактичну дату та час формування",
            "Організаційно-правова форма юридичної особи",
            "Центральний чи місцевий орган виконавчої влади, до сфери управління якого належить юридична особа публічного права або який здійснює функції з управління корпоративними правами держави у відповідній юридичній особі",
            "Код ЄДРПОУ. Центральний чи місцевий орган виконавчої влади, до сфери управління якого належить юридична особа публічного права або який здійснює функції з управління корпоративними правами держави у відповідній юридичній особі",
            "Місцезнаходження юридичної особи",
            "Основний вид економічної діяльності",
            "Інші види економічної діяльності",
            "Назви органів управління юридичної особи",
            "ПІБ засновників(учасників) юридичної особи",
            "Країна громадянства засновників(учасників) юридичної особи",
            "Місцезнаходження засновників(учасників) юридичної особи",
            "Розмір частки засновників(учасників) юридичної особи",
            "Вид установчого документа",
            "Дата запису в Єдиному державному реєстрі юридичних осіб, фізичних осіб - підприємців та громадських формувань",
            "Номер запису в Єдиному державному реєстрі юридичних осіб, фізичних осіб - підприємців та громадських формувань",
            "Місце зберігання реєстраційної справи в паперовій формі",
            "Дата взяття на облік",
            "Номер взяття на облік",
            "Назва органу(облік)",
            "Ідентифікаційний код органу",
            "Перелік контактних телефонів",
            "Електронна адреса",
            "Найменування відокремленого підрозділу",
            "Код ЄДРПОУ відокремленого підрозділу",
            "Роль по відношенню до пов’язаного суб’єкта",
            "Тип відокремленого підрозділу",
            "Дата запису про створення відокремленого підрозділу",
            "ПІБ керівника відокремленого підрозділу",
            "Дата призначення керівника відокремленого підрозділу",
            "Наявність обмежень щодо представництва від імені юридичної особи керівника відокремленого підрозділу",
            "Адреса відокремленого підрозділу юридичної особи",
            "Перелік контактних телефонів відокремленого підрозділу юридичної особи",
            "Електронна адреса відокремленого підрозділу юридичної особи",
            "Інтернет сайт відокремленого підрозділу юридичної особи",
            "Дата запису про державну реєстрацію припинення юридичної особи, або початку процесу ліквідації в залежності від поточного стану («в стані припинення», «припинено»)",
            "Підстава для внесення запису про державну реєстрацію припинення юридичної особи",
            "ПІБ. Відомості про комісію з припинення",
            "Адреса. Відомості про комісію з припинення",
            "Роль. Відомості про комісію з припинення",
            "Відомості про строк, визначений засновниками (учасниками) юридичної особи, судом або органом, що прийняв рішення про припинення юридичної особи, для заявлення кредиторами своїх вимог",
            "Номер провадження про банкрутство",
            "Дата провадження про банкрутство",
            "Дата набуття чинності",
            "Найменування суду",
            "Повна назва суб’єкта. Дані про юридичних осіб, правонаступником яких є зареєстрована юридична особа",
            "ЄДРПОУ код, якщо суб’єкт – юридична особа. Дані про юридичних осіб, правонаступником яких є зареєстрована юридична особа",
            "Адреса. Дані про юридичних осіб, правонаступником яких є зареєстрована юридична особа",
            "ПІБ. Дані про юридичних осіб, правонаступником яких є зареєстрована юридична особа",
            "Роль по відношенню до пов’язаного суб’єкта. Дані про юридичних осіб, правонаступником яких є зареєстрована юридична особа",
            "Посилання на сторінку з детальною інформацією про суб'єкт. Дані про юридичних осіб, правонаступником яких є зареєстрована юридична особа",
            "Повна назва суб’єкта. Дані про юридичних осіб – правонаступників",
            "ЄДРПОУ код, якщо суб’єкт – юридична особа. Дані про юридичних осіб – правонаступників",
            "Адреса. Дані про юридичних осіб – правонаступників",
            "ПІБ. Дані про юридичних осіб – правонаступників",
            "Роль по відношенню до пов’язаного суб’єкта. Дані про юридичних осіб – правонаступників",
            "Посилання на сторінку з детальною інформацією про суб'єкт. Дані про юридичних осіб – правонаступників"

    };
    }
}
